Vicy-DE/Ninebot-G30-Custom/firmware/decompiled/nrf51822/src/nrf51_main.cpp
/**
 * @file nrf51_main.cpp
 * @brief nRF51822 BLE firmware — initialization, main loop, and protocol handling.
 *
 * Reconstructed from BLE_1.1.7.bin Cortex-M0 disassembly analysis.
 *
 * The nRF51822 is the Bluetooth co-processor on the Ninebot G30 Max
 * BLE dashboard. It handles all BLE communication including:
 *   - Nordic UART Service (NUS) for Ninebot protocol relay
 *   - Xiaomi MiIO authentication and cloud binding
 *   - L2CAP channel management for OTA firmware data
 *   - Persistent storage of BLE bonds and MiIO tokens
 *
 * Main loop (event-driven):
 *   1. Poll SoftDevice for BLE events
 *   2. Process UART data from STM32 (protocol relay)
 *   3. Process BLE data from phone app (protocol relay)
 *   4. Drive MiIO state machine
 *   5. Feed watchdog
 *   6. Drain TX queues
 *
 * @see nrf51822_analysis_BLE_1.1.7.txt — 282 functions, 58 SVCs
 * @see Reset handler @ 0x00018155
 * @see UART0 ISR    @ 0x00019E71
 * @see SWI2 ISR     @ 0x00019CB1 (SoftDevice system events)
 */

#include "nrf51_firmware.h"

namespace ninebot {
namespace nrf51 {

/* =========================================================================
 * Constructor
 * ========================================================================= */

Nrf51Firmware::Nrf51Firmware(Nrf51Hal& hal)
    : hal_(hal)
{
}

/* =========================================================================
 * Initialization — Reset Handler Equivalent
 * =========================================================================
 * Reproduces the startup sequence from the reset handler @ 0x00018155.
 *
 * 1. Check GPREGRET (DFU trigger check) — reads but never writes
 * 2. Initialize SoftDevice (sd_ble_enable)
 * 3. Set up BLE services (NUS, MiIO)
 * 4. Configure UART for STM32 communication
 * 5. Load persistent storage (tokens, bonds)
 * 6. Start BLE advertising
 * 7. Start watchdog
 */

void Nrf51Firmware::init()
{
    /* Reset all state */
    bleConnected_ = false;
    connHandle_ = BLE_CONN_HANDLE_INVALID;
    miioState_ = MiioState::IDLE;
    miioReg_ = {};
    uartParser_.reset();
    bleParser_.reset();
    uartTxQueue_.clear();
    bleTxQueue_.clear();
    uartToBleBytes_ = 0;
    bleToUartBytes_ = 0;
    loopCount_ = 0;
    advertising_ = false;
    notifyEnabled_ = false;

    /* Step 1: Check GPREGRET — firmware reads this on boot
     * sd_power_gpregret_get @ 0x0001AABC and 0x0001F1A6
     * Checks for DFU magic value but never triggers DFU */
    if (hal_.softdevice) {
        uint32_t gpregret = 0;
        hal_.softdevice->gpregretGet(gpregret);
        /* CMP r0, #2 → just error checking, not DFU trigger */
    }

    /* Step 2: SoftDevice initialization */
    initSoftDevice();

    /* Step 3: BLE services */
    initBleServices();

    /* Step 4: MiIO init */
    initMiio();

    /* Step 5: UART init */
    initUart();

    /* Step 6: Load PSM data (tokens, bonds) */
    loadPsmData();

    /* Step 7: Start advertising */
    startAdvertising();

    /* Step 8: Watchdog */
    initWatchdog();
}

/* =========================================================================
 * SoftDevice Initialization
 * =========================================================================
 * SVC calls found: sd_ble_enable (0x60), sd_ble_uuid_vs_add (0x63),
 * sd_ble_opt_set (0x65), sd_power_dcdc_mode_set (0x37)
 */

void Nrf51Firmware::initSoftDevice()
{
    if (!hal_.softdevice) return;

    /* Enable BLE stack — SVC #96 (0x60) @ 0x0001C896 */
    hal_.softdevice->bleEnable();

    /* Enable DC-DC converter for power efficiency
     * SVC #55 (0x37) @ 0x0001AAF4 */
    hal_.softdevice->dcdcModeSet(1);
}

/* =========================================================================
 * BLE Service Setup
 * =========================================================================
 * Sets up the Nordic UART Service (NUS) which the Ninebot app uses
 * for bidirectional communication.
 *
 * SVC calls: sd_ble_gatts_service_add (0x90), sd_ble_gatts_char_add (0x92)
 * sd_ble_gap_adv_data_set (0x72), sd_ble_gap_ppcp_set (0x7A)
 */

void Nrf51Firmware::initBleServices()
{
    if (!hal_.softdevice) return;

    /* Add NUS service — custom 128-bit UUID */
    hal_.softdevice->addService(
        1, /* primary service */
        NUS_UUID_BASE,
        nusServiceHandle_);

    /* Add TX characteristic (phone → scooter) */
    uint8_t txProps = 0x08;  /* Write without response */
    hal_.softdevice->addCharacteristic(
        nusServiceHandle_, NUS_UUID_BASE,
        txProps, nusTxHandle_, nusTxCccdHandle_);

    /* Add RX characteristic (scooter → phone) — Notify */
    uint8_t rxProps = 0x10;  /* Notify */
    uint16_t rxCccd = 0;
    hal_.softdevice->addCharacteristic(
        nusServiceHandle_, NUS_UUID_BASE,
        rxProps, nusRxHandle_, rxCccd);

    /* Set connection parameters
     * SVC #122 (0x7A) @ 0x0001B076 */
    hal_.softdevice->setPPCP(
        16,    /* min interval: 20ms (16 * 1.25ms) */
        32,    /* max interval: 40ms */
        0,     /* slave latency: 0 */
        400    /* supervision timeout: 4s */
    );

    /* Set TX power */
    hal_.softdevice->setTxPower(0);  /* 0 dBm */
}

/* =========================================================================
 * MiIO Initialization
 * =========================================================================
 * From firmware string: "[E]: Mi Serivce Init fail, error code=%d"
 */

void Nrf51Firmware::initMiio()
{
    miioState_ = MiioState::IDLE;
    miioReg_ = {};

    /* Copy device model to registration */
    std::strncpy(miioReg_.serialNumber, DEVICE_NAME,
                 sizeof(miioReg_.serialNumber) - 1);
}

/* =========================================================================
 * UART Initialization
 * =========================================================================
 * From firmware analysis: UART0 register references at 0x0001FDC8 (ENABLE),
 * 0x0001FDD4 (TASKS_STARTRX), 0x0001FDDC, 0x0001FDF8, 0x0001FE04
 *
 * Pin config: P0.08 = TX, P0.09 = RX, 115200 baud
 */

void Nrf51Firmware::initUart()
{
    if (!hal_.uart) return;

    hal_.uart->enable();

