Vicy-DE/Ninebot-G30-Custom/firmware/decompiled/nrf51822/src/nrf51_main.cpp
    /* Configure UART pins via GPIO */
    if (hal_.gpio) {
        hal_.gpio->configureOutput(pin::UART_TX);
        hal_.gpio->configureInput(pin::UART_RX, 0);
    }
}

/* =========================================================================
 * Watchdog Initialization
 * =========================================================================
 * WDT ISR @ 0x0001A1B5
 */

void Nrf51Firmware::initWatchdog()
{
    if (hal_.wdt) {
        hal_.wdt->start(5000);  /* 5 second timeout */
    }
}

/* =========================================================================
 * PSM Data Loading
 * =========================================================================
 * From firmware strings:
 *   "psm retrive succ, "
 *   "retrive token, %02x %02x"
 *   "[E]: flash read error"
 */

void Nrf51Firmware::loadPsmData()
{
    if (!hal_.psm) return;

    /* Register PSM callback */
    hal_.psm->registerCallback(
        [this](PsmOpcode op, PsmResult res, uint16_t len) {
            psmCallback(op, res, len);
        });

    /* Register flash write function
     * Guards against "[W]: flash write func not setting" */
    hal_.psm->registerFlashWriteFunc();

    /* Load stored token */
    loadToken();
}

/* =========================================================================
 * Main Loop
 * =========================================================================
 * Event-driven processing. Called repeatedly.
 */

void Nrf51Firmware::mainLoopIteration()
{
    loopCount_++;

    /* 1. Poll SoftDevice for BLE events */
    if (hal_.softdevice) {
        BleEventType evtType;
        uint16_t evtConnHandle;
        while (hal_.softdevice->getEvent(evtType, evtConnHandle)) {
            switch (evtType) {
                case BleEventType::CONNECTED:
                    onBleConnected(evtConnHandle);
                    break;
                case BleEventType::DISCONNECTED:
                    onBleDisconnected(evtConnHandle);
                    break;
                case BleEventType::SYS_EVT_FLASH_OP:
                    /* Flash operation complete — handled via SWI2 */
                    swi2Isr();
                    break;
                default:
                    break;
            }
        }
    }

    /* 2. Drain UART TX queue (send queued packets to STM32) */
    drainUartTx();

    /* 3. Drain BLE TX queue (send notifications to phone) */
    drainBleTx();

    /* 4. Feed watchdog */
    if (hal_.wdt) {
        hal_.wdt->feed();
    }
}

/* =========================================================================
 * Interrupt Handlers
 * ========================================================================= */

/**
 * UART0 RX ISR — receives bytes from STM32.
 *
 * ISR @ 0x00019E71
 * Each byte is fed to the Ninebot protocol parser.
 */
void Nrf51Firmware::uart0RxIsr(uint8_t byte)
{
    parseUartByte(byte);
}

/**
 * GPIOTE ISR — GPIO events.
 * ISR @ 0x00018CE9
 */
void Nrf51Firmware::gpioteIsr()
{
    /* GPIO event — may trigger on external signal */
}

/**
 * TIMER1 ISR — application timer.
 * ISR @ 0x00019D1D
 */
void Nrf51Firmware::timer1Isr()
{
    /* Timer event */
}

/**
 * WDT ISR — watchdog timeout.
 * ISR @ 0x0001A1B5
 */
void Nrf51Firmware::wdtIsr()
{
    /* Watchdog timeout — system should reset */
}

/**
 * RTC1 ISR — real-time counter.
 * ISR @ 0x00019C3D
 */
void Nrf51Firmware::rtc1Isr()
{
    /* RTC1 event — BLE timing */
}

/**
 * SWI0 ISR — software interrupt 0.
 * ISR @ 0x00019C5D
 */
void Nrf51Firmware::swi0Isr()
{
    /* Software interrupt 0 */
}

/**
 * SWI2 ISR — SoftDevice system events (flash complete).
 * ISR @ 0x00019CB1
 *
 * This is the callback path for sd_flash_write/sd_flash_page_erase.
 * The PSM uses this to know when flash operations are done.
 */
void Nrf51Firmware::swi2Isr()
{
    /* Flash operation complete notification.
     * PSM callback was already registered in loadPsmData(). */
}


/* =========================================================================
 * BLE Event Handlers
 * =========================================================================
 * From firmware strings: "On Connected", "On Token Written", etc.
 */

void Nrf51Firmware::onBleConnected(uint16_t connHandle)
{
    bleConnected_ = true;
    connHandle_ = connHandle;

    /* If we were advertising, stop now */
    advertising_ = false;

    /* Start MiIO auth flow */
    miioAdvance(MiioState::WAIT_AUTH);
}

void Nrf51Firmware::onBleDisconnected(uint16_t /*connHandle*/)
{
    bleConnected_ = false;
    connHandle_ = BLE_CONN_HANDLE_INVALID;
    notifyEnabled_ = false;

    /* Reset MiIO state */
    miioState_ = MiioState::IDLE;

    /* Restart advertising */
    startAdvertising();
}

/**
 * Handle GATT write from phone app.
 *
 * Two paths:
 *   1. NUS TX characteristic — Ninebot protocol data
 *   2. MiIO characteristics — authentication flow
 */
void Nrf51Firmware::onGattsWrite(uint16_t handle, const uint8_t* data, uint16_t len)
{
    if (handle == nusTxHandle_) {
        /* Ninebot protocol data from phone app */
        for (uint16_t i = 0; i < len; i++) {
            parseBleByte(data[i]);
        }
    } else if (handle == nusTxCccdHandle_) {
        /* CCCD write — enable/disable notifications */
        if (len >= 2) {
            notifyEnabled_ = (data[0] | (data[1] << 8)) != 0;
        }
    } else {
        /* MiIO characteristic writes */
        if (miioState_ == MiioState::WAIT_AUTH) {
            miioHandleAuth(data, len);
        } else if (miioState_ == MiioState::WAIT_TOKEN) {
            miioHandleToken(data, len);
        } else if (miioState_ == MiioState::WAIT_SN) {
            miioHandleSN(data, len);
        }
    }
}

/**
 * Handle L2CAP RX event.
 * From firmware analysis: 14 L2CAP SVC calls for MiIO OTA data.
 */
void Nrf51Firmware::onL2capRx(uint16_t /*cid*/, const uint8_t* data, uint16_t len)
{
    /* L2CAP data — MiIO OTA firmware data transfer
     * The MiIO SDK processes this internally through the PSM layer */
    if (miioReg_.flashRegistered && hal_.psm && len > 0) {
        /* Write received firmware data to flash via PSM */
        hal_.psm->store(0x0100, data, len);
    }
}


/* =========================================================================
 * Ninebot Protocol Parsing — UART (from STM32)
 * =========================================================================
 * Same state machine as STM32 side.
 * From firmware: CMP R0, #0x5A at 0x0001854E, 0x1A030
 *                CMP R0, #0xA5 at 0x18554, 0x1A034
 */

void Nrf51Firmware::parseUartByte(uint8_t byte)
{
    if (uartParser_.receiving) {
        uartParser_.rxBuffer[uartParser_.rxIndex] = byte;

        /* First byte = LEN */
        if (uartParser_.rxIndex == 0) {
            uartParser_.expectedLength = byte + 7;  /* expected body = LEN + 7 (LEN=payload) */
            if (uartParser_.expectedLength > 249) {
                uartParser_.reset();
                return;
            }
        }

        uartParser_.rxIndex++;

        /* Packet complete? */
        if (uartParser_.rxIndex == uartParser_.expectedLength) {
            verifyAndDispatch(uartParser_,
                              &Nrf51Firmware::handleUartPacket);
            uartParser_.reset();
        } else {
            uartParser_.runningChecksum += byte;
        }
        return;
    }

    /* Header detection */
    if (byte == NB_HEADER_1) {
        if (!uartParser_.gotHeader1) {
            uartParser_.gotHeader1 = true;
            return;
        }
    } else if (byte == NB_HEADER_2) {
        if (uartParser_.gotHeader1) {
            uartParser_.receiving = true;
            uartParser_.runningChecksum = 0;
            uartParser_.rxIndex = 0;
            return;
        }
    }
    uartParser_.reset();
}

/* =========================================================================
 * Ninebot Protocol Parsing — BLE (from phone app)
 * =========================================================================
 * Second protocol parser instance.
 * From firmware: CMP R0, #0x5A at 0x1A030; CMP R0, #0xA5 at 0x1A034
 */

void Nrf51Firmware::parseBleByte(uint8_t byte)
{
    if (bleParser_.receiving) {
        bleParser_.rxBuffer[bleParser_.rxIndex] = byte;

        if (bleParser_.rxIndex == 0) {
            bleParser_.expectedLength = byte + 7;  /* expected body = LEN + 7 (LEN=payload) */
            if (bleParser_.expectedLength > 249) {
                bleParser_.reset();
                return;
            }
        }

        bleParser_.rxIndex++;

