Vicy-DE/Ninebot-G30-Custom/firmware/decompiled/nrf51822/src/nrf51_main.cpp
        if (bleParser_.rxIndex == bleParser_.expectedLength) {
            verifyAndDispatch(bleParser_,
                              &Nrf51Firmware::handleBlePacket);
            bleParser_.reset();
        } else {
            bleParser_.runningChecksum += byte;
        }
        return;
    }

    if (byte == NB_HEADER_1) {
        if (!bleParser_.gotHeader1) {
            bleParser_.gotHeader1 = true;
            return;
        }
    } else if (byte == NB_HEADER_2) {
        if (bleParser_.gotHeader1) {
            bleParser_.receiving = true;
            bleParser_.runningChecksum = 0;
            bleParser_.rxIndex = 0;
            return;
        }
    }
    bleParser_.reset();
}

/* =========================================================================
 * Checksum Calculation
 * =========================================================================
 * Same algorithm as STM32 side: sum bytes, bitwise NOT, mask 16-bit.
 */

uint16_t Nrf51Firmware::calcChecksum(const uint8_t* data, size_t length)
{
    uint16_t sum = 0;
    for (size_t i = 0; i < length; ++i) {
        sum += data[i];
    }
    return static_cast<uint16_t>(~sum);
}

/* =========================================================================
 * Verify and Dispatch
 * ========================================================================= */

void Nrf51Firmware::verifyAndDispatch(
    NbParserState& parser,
    void (Nrf51Firmware::*handler)(const NbPacket&))
{
    uint8_t chkLo = parser.rxBuffer[parser.expectedLength - 2];
    uint8_t chkHi = parser.rxBuffer[parser.expectedLength - 1];
    uint16_t calc = static_cast<uint16_t>(
        ~(parser.runningChecksum - chkLo) & 0xFFFF);
    uint16_t recv = uint16_t(chkLo) | (uint16_t(chkHi) << 8);

    if (calc == recv) {
        NbPacket pkt{};
        pkt.length        = parser.rxBuffer[0];
        pkt.source        = parser.rxBuffer[1];
        pkt.destination   = parser.rxBuffer[2];
        pkt.command       = parser.rxBuffer[3];
        pkt.argument      = parser.rxBuffer[4];
        pkt.payloadLength = (pkt.length <= NB_MAX_PAYLOAD) ? pkt.length : 0;  /* LEN = payload count */
        pkt.checksum      = recv;
        if (pkt.payloadLength > 0 && pkt.payloadLength <= NB_MAX_PAYLOAD) {
            std::memcpy(pkt.payload, &parser.rxBuffer[5], pkt.payloadLength);
        }
        (this->*handler)(pkt);
    }
    /* Invalid checksum: silently drop (matches firmware behavior) */
}

/* =========================================================================
 * Packet Handlers
 * =========================================================================
 * The nRF51822 acts as a transparent protocol bridge:
 *   - Packets from UART (STM32) → relay to BLE (phone app)
 *   - Packets from BLE (phone) → relay to UART (STM32)
 *
 * Packets addressed to BLE (0x21) go both directions because the
 * STM32 on the BLE board handles BLE-addressed packets.
 *
 * The nRF51822 does NOT process Ninebot register read/write itself.
 * It's a pure relay.
 */

void Nrf51Firmware::handleUartPacket(const NbPacket& pkt)
{
    /* Everything from STM32 → relay to phone app via BLE */
    enqueuePacket(bleTxQueue_,
                  pkt.source, pkt.destination,
                  pkt.command, pkt.argument,
                  pkt.payload, pkt.payloadLength);
    uartToBleBytes_ += pkt.payloadLength + 9;  /* approximate raw size */
}

void Nrf51Firmware::handleBlePacket(const NbPacket& pkt)
{
    /* Everything from phone app → relay to STM32 via UART */
    enqueuePacket(uartTxQueue_,
                  pkt.source, pkt.destination,
                  pkt.command, pkt.argument,
                  pkt.payload, pkt.payloadLength);
    bleToUartBytes_ += pkt.payloadLength + 9;
}

/* =========================================================================
 * Packet Building & Enqueuing
 * =========================================================================
 * Builds a complete Ninebot protocol packet and adds to TX queue.
 * From firmware: MOVS R0, #0x5A at 0x184CC; MOVS R0, #0xA5 at 0x184D0
 */

void Nrf51Firmware::enqueuePacket(
    std::vector<std::vector<uint8_t>>& queue,
    uint8_t src, uint8_t dst, uint8_t cmd, uint8_t arg,
    const uint8_t* payload, uint8_t payloadLen)
{
    std::vector<uint8_t> pkt;
    pkt.reserve(payloadLen + 9);

    pkt.push_back(NB_HEADER_1);   /* 0x5A */
    pkt.push_back(NB_HEADER_2);   /* 0xA5 */
    pkt.push_back(payloadLen);     /* LEN = payload count */
    pkt.push_back(src);            /* SRC */
    pkt.push_back(dst);            /* DST */
    pkt.push_back(cmd);            /* CMD */
    pkt.push_back(arg);            /* ARG */

    for (uint8_t i = 0; i < payloadLen; i++) {
        pkt.push_back(payload[i]);
    }

    /* Checksum covers bytes [2..end) = LEN through payload */
    uint16_t chk = calcChecksum(&pkt[2], pkt.size() - 2);
    pkt.push_back(static_cast<uint8_t>(chk & 0xFF));
    pkt.push_back(static_cast<uint8_t>((chk >> 8) & 0xFF));

    queue.push_back(std::move(pkt));
}

/* =========================================================================
 * TX Queue Drain
 * ========================================================================= */

size_t Nrf51Firmware::drainUartTx()
{
    size_t count = 0;
    if (!hal_.uart) return 0;

    for (auto& pkt : uartTxQueue_) {
        for (uint8_t b : pkt) {
            hal_.uart->sendByte(b);
            count++;
        }
    }
    uartTxQueue_.clear();
    return count;
}

size_t Nrf51Firmware::drainBleTx()
{
    size_t count = 0;
    if (!hal_.softdevice || !bleConnected_ || !notifyEnabled_) {
        /* Can't send if not connected or notifications disabled.
         * Keep packets queued if disconnected — they'll be sent on reconnect.
         * Actually, clear them: phone will re-request on reconnect. */
        bleTxQueue_.clear();
        return 0;
    }

    for (auto& pkt : bleTxQueue_) {
        sendBleNotification(pkt.data(), static_cast<uint16_t>(pkt.size()));
        count++;
    }
    bleTxQueue_.clear();
    return count;
}

/* =========================================================================
 * BLE Operations
 * ========================================================================= */

