Vicy-DE/Ninebot-G30-Custom/firmware/decompiled/nrf51822/src/nrf51_main.cpp
void Nrf51Firmware::startAdvertising()
{
    if (!hal_.softdevice || advertising_) return;

    /* Set advertising data with device name.
     * Advertising data format:
     *   [len] [type] [data...]
     * Type 0x09 = Complete Local Name */
    uint8_t advData[31];
    size_t nameLen = std::strlen(DEVICE_NAME);
    if (nameLen > 28) nameLen = 28;

    advData[0] = static_cast<uint8_t>(nameLen + 1);  /* Length of this AD struct */
    advData[1] = 0x09;  /* Complete Local Name */
    std::memcpy(&advData[2], DEVICE_NAME, nameLen);

    /* Flags AD struct */
    uint8_t flagsLen = 2;
    advData[nameLen + 2] = flagsLen;
    advData[nameLen + 3] = 0x01;  /* AD type: Flags */
    advData[nameLen + 4] = 0x06;  /* LE General Discoverable + BR/EDR Not Supported */

    uint8_t totalAdvLen = static_cast<uint8_t>(nameLen + 5);

    hal_.softdevice->setAdvData(advData, totalAdvLen, nullptr, 0);
    hal_.softdevice->startAdvertising();
    advertising_ = true;
}

void Nrf51Firmware::sendBleNotification(const uint8_t* data, uint16_t len)
{
    if (!hal_.softdevice || connHandle_ == BLE_CONN_HANDLE_INVALID) return;

    hal_.softdevice->hvx(connHandle_, nusRxHandle_, data, len);
}

/* =========================================================================
 * BLE Data Feed (for testing)
 * ========================================================================= */

void Nrf51Firmware::feedBleBytes(const uint8_t* data, size_t len)
{
    for (size_t i = 0; i < len; i++) {
        parseBleByte(data[i]);
    }
}


/* =========================================================================
 * MiIO State Machine
 * =========================================================================
 * Reconstructed from firmware strings. This implements the Xiaomi MiIO
 * BLE authentication and registration flow.
 *
 * Flow:
 *   IDLE → WAIT_AUTH → AUTH_DECRYPT → WAIT_TOKEN → LOGIN_CONFIRM
 *        → WAIT_CLOUD_BIND → WAIT_APP_BOND → WAIT_SN
 *        → SN_ARRIVED → REGISTERED → FLASH_REGISTERED
 */

void Nrf51Firmware::miioAdvance(MiioState nextState)
{
    miioState_ = nextState;
}

/**
 * Handle auth write from phone.
 * From firmware: "On Auth Written", "decrypted auth, %x"
 */
void Nrf51Firmware::miioHandleAuth(const uint8_t* data, uint16_t len)
{
    if (len < 4) {
        miioAdvance(MiioState::ERROR);
        return;
    }

    /* Decrypt authentication data (simplified — real firmware uses
     * MD5-based challenge-response with Xiaomi cloud credentials) */
    (void)data;  /* Auth data processing */

    /* Advance to token exchange */
    miioAdvance(MiioState::WAIT_TOKEN);
}

/**
 * Handle token write from phone.
 * From firmware: "On Token Written", "login cfm handler, token: %02x %02x",
 *                "decrypted %x", "login cfm succ" / "login cfm fail"
 */
void Nrf51Firmware::miioHandleToken(const uint8_t* data, uint16_t len)
{
    if (len < 16) {
        miioAdvance(MiioState::ERROR);
        return;
    }

    /* Store token */
    std::memcpy(miioReg_.token.data, data, 16);
    miioReg_.token.valid = true;

    /* Login confirm */
    miioHandleLoginConfirm();
}

void Nrf51Firmware::miioHandleLoginConfirm()
{
    /* Verify token (simplified) */
    if (miioReg_.token.valid) {
        /* "login cfm succ" */
        miioHandleCloudBind(true);
    } else {
        /* "login cfm fail" */
        miioAdvance(MiioState::ERROR);
    }
}

/**
 * Handle cloud bind result.
 * From firmware: "cloud bind succ" / "cloud bind fail"
 */
void Nrf51Firmware::miioHandleCloudBind(bool success)
{
    if (success) {
        miioReg_.cloudBound = true;
        miioHandleAppBond(true);
    } else {
        miioAdvance(MiioState::ERROR);
    }
}

/**
 * Handle app bond result.
 * From firmware: "app bond succ" / "app bond fail", "mi_service, bond succ"
 */
void Nrf51Firmware::miioHandleAppBond(bool success)
{
    if (success) {
        miioReg_.appBonded = true;
        miioAdvance(MiioState::WAIT_SN);
    } else {
        miioAdvance(MiioState::ERROR);
    }
}

/**
 * Handle serial number arrival.
 * From firmware: "SN Arrived", "sn: %02x",
 *                "[E]: SN timeout, clear token", "[W]: Weak SN timeout."
 */
void Nrf51Firmware::miioHandleSN(const uint8_t* data, uint16_t len)
{
    if (len == 0) {
        /* SN timeout */
        miioAdvance(MiioState::ERROR);
        return;
    }

    uint16_t copyLen = (len < sizeof(miioReg_.serialNumber) - 1)
                       ? len : sizeof(miioReg_.serialNumber) - 1;
    std::memcpy(miioReg_.serialNumber, data, copyLen);
    miioReg_.serialNumber[copyLen] = '\0';

    miioAdvance(MiioState::SN_ARRIVED);
    miioRegister();
}

/**
 * Complete device registration.
 * From firmware: "Register succ, new token, encrypt sn, beaconkey."
 *                "new token: %02x %02x"
 */
void Nrf51Firmware::miioRegister()
{
    /* Generate beacon key (simplified) */
    std::memset(miioReg_.beaconKey, 0xAA, sizeof(miioReg_.beaconKey));

    miioAdvance(MiioState::REGISTERED);

    /* Save token to PSM */
    saveToken();

    /* Register MiIO flash capability */
    miioFlashRegister();
}

/**
 * Register MiIO flash capability.
 * From firmware: "[D]: miio ble flash register succ"
 *                "[E]: miio ble flash register fail"
 */
void Nrf51Firmware::miioFlashRegister()
{
    if (hal_.psm && hal_.psm->isFlashWriteRegistered()) {
        miioReg_.flashRegistered = true;
        miioAdvance(MiioState::FLASH_REGISTERED);
    } else {
        /* "[W]: flash write func not setting" */
        miioReg_.flashRegistered = false;
    }
}


/* =========================================================================
 * PSM Operations
 * =========================================================================
 * From firmware strings:
 *   "psm callback"
 *   "[D]: update succ. len = %d"
 *   "[D]: load succ, len = %d"
 *   "[D]: store succ. len = %d"
 *   "[D]: clear succ. len = %d"
 */

void Nrf51Firmware::psmCallback(PsmOpcode opcode, PsmResult result, uint16_t /*len*/)
{
    if (result != PsmResult::SUCCESS) {
        /* "[E]: flash operation error, opcode:%d" */
        return;
    }

    switch (opcode) {
        case PsmOpcode::LOAD:
            /* "[D]: load succ, len = %d" */
            break;
        case PsmOpcode::STORE:
            /* "[D]: store succ. len = %d" */
            break;
        case PsmOpcode::UPDATE:
            /* "[D]: update succ. len = %d" */
            break;
        case PsmOpcode::CLEAR:
            /* "[D]: clear succ. len = %d" */
            break;
    }
}

void Nrf51Firmware::saveToken()
{
    if (!hal_.psm || !miioReg_.token.valid) return;

    hal_.psm->store(0x0001, miioReg_.token.data, 16);
}

void Nrf51Firmware::loadToken()
{
    if (!hal_.psm) return;

    uint16_t actualLen = 0;
    if (hal_.psm->load(0x0001, storedToken_.data, 16, actualLen)) {
        storedToken_.valid = (actualLen == 16);
        if (storedToken_.valid) {
            /* "psm retrive succ, " and "retrive token, %02x %02x" */
            std::memcpy(miioReg_.token.data, storedToken_.data, 16);
            miioReg_.token.valid = true;
        }
    }
}


} // namespace nrf51
} // namespace ninebot
